Конвертация_данных_31_демо.Conversion_3_Plus/src/InformationRegisters/Расш1_ТекстыМодулей/Расш1_ТекстыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_ТекстыМодулей</name>
  <comment>Тексты модулей релиза для подсказок консоли</comment>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Глобальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.Расш1_ВидыМодулей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Enums/Расш1_ВидыМодулей/Расш1_ВидыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Расш1_ВидыМодулей</name>
  <comment>Вид текста модуля конфигурации.</comment>
  <enumValues>
    <name>ОбщийМодуль</name>
  </enumValues>
  <enumValues>
    <name>МодульМенеджера</name>
  </enumValues>
  <enumValues>
    <name>МодульОбъекта</name>
  </enumValues>
</mdclass:Enum>

Конвертация_данных_31_демо.Conversion_3_Plus/src/CommonModules/Расш1_КонсольКодаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Текст HTML-макета консоли кода (single-file bsl_console).
// 
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьТекстHTMLКонсоли() Экспорт
	
	Макет = ПолучитьОбщийМакет("bsl_console");
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

// JSON описания объекта или списка объектов метаданных для подсказок консоли.
//
// Параметры:
//  ПараметрыЗапроса - Строка - имя коллекции или полный путь объекта.
//  АдресОбновления - Строка - исходящий path для updateMetadata (catalogs.items).
//  Конвертация - СправочникСсылка.Конвертации, СправочникСсылка.Релизы - конвертация или релиз конфигурации.
//  Направление - Строка - Отправка, Получение или пустая строка.
//
// Возвращаемое значение:
//  Структура:
//   * ОписаниеJSON - Строка
//   * АдресОбновления - Строка
//
Функция ПолучитьОписаниеОбъектаМетаданныхJSON(Знач ПараметрыЗапроса, АдресОбновления, Знач Конвертация, Знач Направление = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеJSON", "");
	Результат.Вставить("АдресОбновления", "");
	
	Если ПустаяСтрока(ПараметрыЗапроса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Релизы = РелизыКонвертацииДляМетаданных(Конвертация, Направление);
	ЧастиПути = СтрРазделить(ПараметрыЗапроса, ".");
	ИмяКоллекции = ЧастиПути[0];
	ИмяОбъекта = "";
	Если ЧастиПути.Количество() > 1 Тогда
		ИмяОбъекта = СокрЛП(ЧастиПути[1]);
	КонецЕсли;
	
	Для Каждого Релиз Из Релизы Цикл
		
		Если Не ПустаяСтрока(ИмяОбъекта) Тогда
			Результат.ОписаниеJSON = Расш1_КоллекцияМетаданных.ПолучитьОписаниеОбъектаМетаданных(
				ПараметрыЗапроса, АдресОбновления, Релиз);
			Если ЗначениеЗаполнено(Результат.ОписаниеJSON) Тогда
				Прервать;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Результат.ОписаниеJSON = Расш1_КоллекцияМетаданных.ПолучитьСписокОбъектовМетаданных(
			ИмяКоллекции, АдресОбновления, Релиз);
		Если ЗначениеЗаполнено(Результат.ОписаниеJSON) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.АдресОбновления = АдресОбновления;
	Возврат Результат;
	
КонецФункции

// Прочитать настройки редактора из хранилища общих настроек.
//
// Возвращаемое значение:
//  См. Расш1_КонсольКодаКлиентСервер.НовыеНастройкиРедактора
//
Функция ПрочитатьНастройкиРедактора() Экспорт
	
	Настройки = ХранилищеОбщихНастроек.Загрузить(
		Расш1_КонсольКодаКлиентСервер.КлючОбъектаНастроек(),
		Расш1_КонсольКодаКлиентСервер.КлючНастройкиРедактора());
	
	Возврат Расш1_КонсольКодаКлиентСервер.ДополнитьНастройкиРедактора(Настройки);
	
КонецФункции

// Признак, что на формах правил нужно создавать HTML-хост.
//
// Возвращаемое значение:
//  Булево
//
Функция КонсольВключена() Экспорт
	
	Возврат Расш1_КонсольКодаКлиентСервер.КонсольВключена(ПрочитатьНастройкиРедактора());
	
КонецФункции

// Релиз конвертации, если в справочнике Объекты нет загруженной структуры.
//
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации
//
// Возвращаемое значение:
//  СправочникСсылка.Релизы - релиз без загруженной структуры; Неопределено, если описание есть.
//
Функция РелизКонвертацииЕслиНетОписания(Знач Конвертация) Экспорт
	
	Возврат Расш1_КоллекцияМетаданных.РелизКонвертацииЕслиНетОписания(Конвертация);
	
КонецФункции

// Сохранить настройки редактора в хранилище общих настроек.
//
// Параметры:
//  Настройки - См. Расш1_КонсольКодаКлиентСервер.НовыеНастройкиРедактора
//
Процедура СохранитьНастройкиРедактора(Знач Настройки) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(
		Расш1_КонсольКодаКлиентСервер.КлючОбъектаНастроек(),
		Расш1_КонсольКодаКлиентСервер.КлючНастройкиРедактора(),
		Расш1_КонсольКодаКлиентСервер.ДополнитьНастройкиРедактора(Настройки));
	
КонецПроцедуры

// Текст модуля конфигурации для parseCommonModule / parseMetadataModule.
//
// Параметры:
//  ПутьМетаданных - Строка - путь события EVENT_GET_METADATA, например module.Имя.
//  Конвертация - СправочникСсылка.Конвертации, СправочникСсылка.Релизы - конвертация или релиз конфигурации.
//  Направление - Строка - Отправка, Получение или пустая строка.
//
// Возвращаемое значение:
//  Структура:
//   * Текст - Строка
//   * Глобальный - Булево
//   * ИмяМодуля - Строка
//   * АдресОбновления - Строка
//   * ЭтоОбщийМодуль - Булево
//
Функция ПолучитьТекстМодуля(Знач ПутьМетаданных, Знач Конвертация, Знач Направление = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Текст", "");
	Результат.Вставить("Глобальный", Ложь);
	Результат.Вставить("ИмяМодуля", "");
	Результат.Вставить("АдресОбновления", "");
	Результат.Вставить("ЭтоОбщийМодуль", Ложь);
	
	ОписаниеЗапроса = ОписаниеЗапросаМодуля(ПутьМетаданных);
	Если ОписаниеЗапроса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ЭтоОбщийМодуль = ОписаниеЗапроса.ЭтоОбщийМодуль;
	Релизы = РелизыКонвертацииДляМетаданных(Конвертация, Направление);
	ТекстыРелизов = ТекстыМодуляРелизов(Релизы, ОписаниеЗапроса.Вид, ОписаниеЗапроса.Ключ);
	Для Каждого Релиз Из Релизы Цикл
		
		ЗаписьМодуля = ТекстыРелизов.Получить(Релиз);
		Если ЗаписьМодуля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Текст = ЗаписьМодуля.Текст;
		Результат.Глобальный = ЗаписьМодуля.Глобальный;
		Результат.ИмяМодуля = ЗаписьМодуля.Ключ;
		Если ОписаниеЗапроса.ЭтоОбщийМодуль Тогда
			Прервать;
		КонецЕсли;
		
		ИмяОбъекта = Расш1_КоллекцияМетаданных.ИмяОбъектаМетаданных(
			Релиз, ОписаниеЗапроса.ИмяКоллекции, ОписаниеЗапроса.ИмяОбъекта);
		ИмяКоллекцииJSON = Расш1_МодульПовтИсп.НовыеИменаКоллекцииМетаданныхJSON()[ОписаниеЗапроса.ИмяКоллекции];
		Если ПустаяСтрока(ИмяОбъекта) Или ИмяКоллекцииJSON = Неопределено Тогда
			Результат.Текст = "";
			Продолжить;
		КонецЕсли;
		
		Результат.АдресОбновления = ИмяКоллекцииJSON + ".items." + ИмяОбъекта + "." + ОписаниеЗапроса.Суффикс;
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// JSON имен общих модулей релиза для updateMetadata, path commonModules.items.
//
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации, СправочникСсылка.Релизы - конвертация или релиз конфигурации.
//  Направление - Строка - Отправка, Получение или пустая строка.
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьИменаОбщихМодулейJSON(Знач Конвертация, Знач Направление = "") Экспорт
	
	Релизы = РелизыКонвертацииДляМетаданных(Конвертация, Направление);
	Если Релизы.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Общие модули: ключ без точки. Вид не фильтруем — записи могли остаться
	// с устаревшей ссылкой перечисления после обновления расширения.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТекстыМодулей.Ключ КАК Ключ
	|ИЗ
	|	РегистрСведений.Расш1_ТекстыМодулей КАК ТекстыМодулей
	|ГДЕ
	|	ТекстыМодулей.Релиз В (&Релизы)
	|	И НЕ ТекстыМодулей.Ключ ПОДОБНО ""%.%""";
	Запрос.УстановитьПараметр("Релизы", Релизы);
	
	ИменаМодулей = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		ИменаМодулей.Вставить(Выборка.Ключ, Новый Структура);
	КонецЦикла;
	
	Если ИменаМодулей.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ИменаМодулей);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Релизы конвертации для подсказок метаданных.
// XDTO: всегда Конфигурация (направление влияет только на customObjects).
// XML: Отправка — Конфигурация, Получение — КонфигурацияКорреспондент.
//
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации, СправочникСсылка.Релизы - конвертация или релиз конфигурации.
//  Направление - Строка - Отправка или Получение. Для XDTO не используется; для XML пустая строка — без релизов.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Релизы
//
Функция РелизыКонвертацииДляМетаданных(Конвертация, Направление = "")
	
	Релизы = Новый Массив;
	Если Не ЗначениеЗаполнено(Конвертация) Тогда
		Возврат Релизы;
	КонецЕсли;
	
	Если ТипЗнч(Конвертация) = Тип("СправочникСсылка.Релизы") Тогда
		Релизы.Добавить(Конвертация);
		Возврат Релизы;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Конвертация, "ТипКонвертации, Конфигурация, КонфигурацияКорреспондент");
	
	Если ЗначенияРеквизитов.ТипКонвертации <> Перечисления.ТипыКонвертаций.XML Тогда
		
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.Конфигурация) Тогда
			Релизы.Добавить(ЗначенияРеквизитов.Конфигурация);
		КонецЕсли;
		Возврат Релизы;
		
	КонецЕсли;
	
	Если Направление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение() Тогда
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.КонфигурацияКорреспондент) Тогда
			Релизы.Добавить(ЗначенияРеквизитов.КонфигурацияКорреспондент);
		ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквизитов.Конфигурация) Тогда
			Релизы.Добавить(ЗначенияРеквизитов.Конфигурация);
		КонецЕсли;
		Возврат Релизы;
	КонецЕсли;
	
	Если Направление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка() Тогда
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.Конфигурация) Тогда
			Релизы.Добавить(ЗначенияРеквизитов.Конфигурация);
		КонецЕсли;
		Возврат Релизы;
	КонецЕсли;
	
	Возврат Релизы;
	
КонецФункции

Функция ОписаниеЗапросаМодуля(ПутьМетаданных)
	
	ЧастиПути = СтрРазделить(НРег(ПутьМетаданных), ".", Ложь);
	Если ЧастиПути.Количество() < 2 Или ЧастиПути[0] <> "module" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Описание = Новый Структура;
	Описание.Вставить("ЭтоОбщийМодуль", Ложь);
	Описание.Вставить("Вид", Перечисления.Расш1_ВидыМодулей.ПустаяСсылка());
	Описание.Вставить("Ключ", "");
	Описание.Вставить("ИмяКоллекции", "");
	Описание.Вставить("ИмяОбъекта", "");
	Описание.Вставить("Суффикс", "");
	
	Если ЧастиПути.Количество() = 2 Тогда
		Описание.ЭтоОбщийМодуль = Истина;
		Описание.Вид = Перечисления.Расш1_ВидыМодулей.ОбщийМодуль;
		Описание.Ключ = ЧастиПути[1];
		Возврат Описание;
	КонецЕсли;
	
	Если ЧастиПути.Количество() <> 4 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЧастиПути[1] = "manager" Тогда
		Описание.Вид = Перечисления.Расш1_ВидыМодулей.МодульМенеджера;
		Описание.Суффикс = "manager";
	ИначеЕсли ЧастиПути[1] = "object" Тогда
		Описание.Вид = Перечисления.Расш1_ВидыМодулей.МодульОбъекта;
		Описание.Суффикс = "object";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКоллекции = Расш1_МодульПовтИсп.НовыеИменаКоллекцииМетаданных()[ЧастиПути[2]];
	Если ИмяКоллекции = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Описание.ИмяКоллекции = ИмяКоллекции;
	Описание.ИмяОбъекта = ЧастиПути[3];
	Описание.Ключ = ИмяКоллекции + "." + ЧастиПути[3];
	Возврат Описание;
	
КонецФункции

Функция ТекстыМодуляРелизов(Релизы, Вид, Ключ)
	
	ТекстыРелизов = Новый Соответствие;
	Если Релизы.Количество() = 0 Или ПустаяСтрока(Ключ) Тогда
		Возврат ТекстыРелизов;
	КонецЕсли;
	
	// Ключ ищем без учёта регистра; Вид не фильтруем — ключ уникален в разрезе релиза
	// (общий модуль без точки, модуль объекта/менеджера — с точкой).
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекстыМодулей.Релиз КАК Релиз,
	|	ТекстыМодулей.Ключ КАК Ключ,
	|	ТекстыМодулей.Текст КАК Текст,
	|	ТекстыМодулей.Глобальный КАК Глобальный,
	|	ТекстыМодулей.Вид КАК Вид
	|ИЗ
	|	РегистрСведений.Расш1_ТекстыМодулей КАК ТекстыМодулей
	|ГДЕ
	|	ТекстыМодулей.Релиз В (&Релизы)
	|	И ВРЕГ(ТекстыМодулей.Ключ) = ВРЕГ(&Ключ)";
	Запрос.УстановитьПараметр("Релизы", Релизы);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Вид) И ЗначениеЗаполнено(Выборка.Вид) И Выборка.Вид <> Вид Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьМодуля = Новый Структура;
		ЗаписьМодуля.Вставить("Ключ", Выборка.Ключ);
		ЗаписьМодуля.Вставить("Текст", Выборка.Текст);
		ЗаписьМодуля.Вставить("Глобальный", Выборка.Глобальный);
		ТекстыРелизов.Вставить(Выборка.Релиз, ЗаписьМодуля);
		
	КонецЦикла;
	
	Возврат ТекстыРелизов;
	
КонецФункции

#КонецОбласти
